{
    "backend": "tensorflow",
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "ZeroPadding2D",
            "config": {
                "batch_input_shape": [
                    null,
                    32,
                    32,
                    1
                ],
                "data_format": "channels_last",
                "dtype": "float32",
                "name": "zero_padding2d_1",
                "padding": [
                    [
                        5,
                        5
                    ],
                    [
                        5,
                        5
                    ]
                ],
                "trainable": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "dtype": "float32",
                "filters": 32,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "kernel_size": [
                    3,
                    3
                ],
                "name": "conv2d_1",
                "padding": "valid",
                "strides": [
                    1,
                    1
                ],
                "trainable": true,
                "use_bias": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "dtype": "float32",
                "filters": 64,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "kernel_size": [
                    3,
                    3
                ],
                "name": "conv2d_2",
                "padding": "valid",
                "strides": [
                    1,
                    1
                ],
                "trainable": true,
                "use_bias": true
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "data_format": "channels_last",
                "dtype": "float32",
                "name": "max_pooling2d_1",
                "padding": "valid",
                "pool_size": [
                    2,
                    2
                ],
                "strides": [
                    2,
                    2
                ],
                "trainable": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "dtype": "float32",
                "filters": 128,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "kernel_size": [
                    3,
                    3
                ],
                "name": "conv2d_3",
                "padding": "valid",
                "strides": [
                    1,
                    1
                ],
                "trainable": true,
                "use_bias": true
            }
        },
        {
            "class_name": "Conv2D",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "data_format": "channels_last",
                "dilation_rate": [
                    1,
                    1
                ],
                "dtype": "float32",
                "filters": 128,
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "kernel_size": [
                    3,
                    3
                ],
                "name": "conv2d_4",
                "padding": "valid",
                "strides": [
                    1,
                    1
                ],
                "trainable": true,
                "use_bias": true
            }
        },
        {
            "class_name": "MaxPooling2D",
            "config": {
                "data_format": "channels_last",
                "dtype": "float32",
                "name": "max_pooling2d_2",
                "padding": "valid",
                "pool_size": [
                    3,
                    3
                ],
                "strides": [
                    3,
                    3
                ],
                "trainable": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "dtype": "float32",
                "name": "dropout_1",
                "rate": 0.5,
                "trainable": true
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "dtype": "float32",
                "name": "flatten_1",
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "relu",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "dtype": "float32",
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_1",
                "trainable": true,
                "units": 2048,
                "use_bias": true
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "dtype": "float32",
                "name": "dropout_2",
                "rate": 0.5,
                "trainable": true
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "activation": "softmax",
                "activity_regularizer": null,
                "bias_constraint": null,
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {
                        "dtype": "float32"
                    }
                },
                "bias_regularizer": null,
                "dtype": "float32",
                "kernel_constraint": null,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "distribution": "uniform",
                        "dtype": "float32",
                        "mode": "fan_avg",
                        "scale": 1.0,
                        "seed": null
                    }
                },
                "kernel_regularizer": null,
                "name": "dense_2",
                "trainable": true,
                "units": 10,
                "use_bias": true
            }
        }
    ],
    "keras_version": "2.0.2-tf"
}